//REVOKEU EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB DD DISP=SHR,
//  DSN=${instance-DSNLOAD}
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
 DSN S(${instance-MVSSNAME})
 RUN PROGRAM(${instance-PROGNAME}) PLAN(${instance-PLANNAME}) -
      LIB('${instance-RUNLIB}')
 END
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSIN    DD *
 REVOKE DBADM ON DATABASE ${instance-DBNAME}
 FROM ${instance-USERNAME};
